
/*------------------*/
/* インクルード		*/
/*------------------*/
#include "Reversi.h"
#include "Reversi_Point.h"

/*------------------*/
/* メンバ関数		*/
/*------------------*/

/*----------------------------------------------------------*/
/*															*/	
/*	[関数]	Reversi_Point	:	引数なしコンストラクタ		*/
/*----------------------------------------------------------*/
Reversi_Point::Reversi_Point()
{
	m_Color = EMPTY;
	m_dir	= REVERSED_NONE;
}
/*----------------------------------------------------------*/
/*															*/
/*	[関数]	Reversi_Point()	:	引数ありコンストラクタ		*/
/*	---------------------------------------------------		*/
/*	[戻り値]	void		:	なし						*/
/*	[引数]		int			:	石のX座標					*/
/*				int			:	石のY座標					*/
/*				Stone_Color	:	石の状態					*/
/*----------------------------------------------------------*/
Reversi_Point::Reversi_Point( short color, unsigned short dir )
{
	m_Color = color;
	m_dir = dir;
}
/*----------------------------------------------------------*/
/*															*/
/*	[関数]		GetColor			:	座標の状態を取得	*/
/*	---------------------------------------------------		*/
/*	[戻り値]	const short&		:	座標の状態			*/
/*	[引数]								なし				*/
/*----------------------------------------------------------*/
const short& Reversi_Point::GetColor() const
{
	return m_Color;
}
/*----------------------------------------------------------*/
/*															*/
/*	[関数]		SetColor			:	座標の状態を設定	*/
/*	---------------------------------------------------		*/
/*	[戻り値]	const short&		:	座標の状態			*/
/*	[引数]								なし				*/
/*----------------------------------------------------------*/
short& Reversi_Point::SetColor()
{
	return m_Color;
}
/*------------------------------------------------------------------------------*/
/*																				*/
/*	[関数]		GetDirection				:	座標位置から裏返せる方向の取得	*/
/*	---------------------------------------------------------------------------	*/
/*	[戻り値]	const unsigned short&		:	座標の状態						*/
/*	[引数]										なし							*/
/*------------------------------------------------------------------------------*/
const unsigned short& Reversi_Point::GetDirection() const
{
	return m_dir;
}
/*------------------------------------------------------------------------------*/
/*																				*/
/*	[関数]		SetDirection				:	座標位置から裏返せる方向の設定	*/
/*	---------------------------------------------------------------------------	*/
/*	[戻り値]	const unsigned short&		:	座標の状態						*/
/*	[引数]										なし							*/
/*------------------------------------------------------------------------------*/
unsigned short& Reversi_Point::SetDirection()
{
	return m_dir;
}
